
name: "BN-Inception"
layer {
  name: "data"
  type: "VideoData"
  top: "data"
  top: "label"
  video_data_param {
    source: "data/hmdb_train_1.txt"
    batch_size: 4
    new_length: 5
    num_segments: 25
    modality: FLOW
    shuffle: true
    name_pattern: "flow_%c_%05d.jpg"
  }
  transform_param{
    crop_size: 224
    mirror: true
    fix_crop: true
    more_fix_crop: true
    multi_scale: true
    max_distort: 1
    scale_ratios: [1,.875,.75]
    mean_value: 128
    is_flow: true
  }
  include: { phase: TRAIN }
}
layer {
  name: "data"
  type: "VideoData"
  top: "data"
  top: "label"
  video_data_param {
    source: "data/hmdb_val_1.txt"
    batch_size: 4
    new_length: 5
    num_segments: 25
    modality: FLOW
    name_pattern: "flow_%c_%05d.jpg"
  }
  transform_param{
    crop_size: 224
    mirror: false
    mean_value: 128
    is_flow: true
  }
  include: { phase: TEST }
}
layer { name: "reshape_data" type: "Reshape" bottom: "data" top: "reshape_data" reshape_param { shape { dim: -1 dim: 10 dim: 224 dim: 224 } } }
 

layer {
  name: "conv1_7x7_s2"
  type: "Convolution"
  bottom: "reshape_data"
  top: "conv1_7x7_s2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv1_7x7_s2_bn"
  type: "BN"
  bottom: "conv1_7x7_s2"
  top: "conv1_7x7_s2_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv1_relu_7x7_inp"
  type: "ReLU"
  bottom: "conv1_7x7_s2_bn"
  top: "conv1_7x7_s2_bn"
}
layer {
  name: "pool1_3x3_s2"
  type: "Pooling"
  bottom: "conv1_7x7_s2_bn"
  top: "pool1_3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv2_3x3_reduce"
  type: "Convolution"
  bottom: "pool1_3x3_s2"
  top: "conv2_3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv2_3x3_reduce_bn"
  type: "BN"
  bottom: "conv2_3x3_reduce"
  top: "conv2_3x3_reduce_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv2_relu_3x3_reduce_inp"
  type: "ReLU"
  bottom: "conv2_3x3_reduce_bn"
  top: "conv2_3x3_reduce_bn"
}
layer {
  name: "conv2_3x3"
  type: "Convolution"
  bottom: "conv2_3x3_reduce_bn"
  top: "conv2_3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv2_3x3_bn"
  type: "BN"
  bottom: "conv2_3x3"
  top: "conv2_3x3_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv2_relu_3x3_inp"
  type: "ReLU"
  bottom: "conv2_3x3_bn"
  top: "conv2_3x3_bn"
}
layer {
  name: "pool2_3x3_s2"
  type: "Pooling"
  bottom: "conv2_3x3_bn"
  top: "pool2_3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inception_3a_1x1"
  type: "Convolution"
  bottom: "pool2_3x3_s2"
  top: "inception_3a_1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3a_1x1_bn"
  type: "BN"
  bottom: "inception_3a_1x1"
  top: "inception_3a_1x1_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3a_relu_1x1_inp"
  type: "ReLU"
  bottom: "inception_3a_1x1_bn"
  top: "inception_3a_1x1_bn"
}
layer {
  name: "inception_3a_3x3_reduce"
  type: "Convolution"
  bottom: "pool2_3x3_s2"
  top: "inception_3a_3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3a_3x3_reduce_bn"
  type: "BN"
  bottom: "inception_3a_3x3_reduce"
  top: "inception_3a_3x3_reduce_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3a_relu_3x3_reduce_inp"
  type: "ReLU"
  bottom: "inception_3a_3x3_reduce_bn"
  top: "inception_3a_3x3_reduce_bn"
}
layer {
  name: "inception_3a_3x3"
  type: "Convolution"
  bottom: "inception_3a_3x3_reduce_bn"
  top: "inception_3a_3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3a_3x3_bn"
  type: "BN"
  bottom: "inception_3a_3x3"
  top: "inception_3a_3x3_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3a_relu_3x3_inp"
  type: "ReLU"
  bottom: "inception_3a_3x3_bn"
  top: "inception_3a_3x3_bn"
}
layer {
  name: "inception_3a_double_3x3_reduce"
  type: "Convolution"
  bottom: "pool2_3x3_s2"
  top: "inception_3a_double_3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3a_double_3x3_reduce_bn"
  type: "BN"
  bottom: "inception_3a_double_3x3_reduce"
  top: "inception_3a_double_3x3_reduce_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3a_relu_double_3x3_reduce_inp"
  type: "ReLU"
  bottom: "inception_3a_double_3x3_reduce_bn"
  top: "inception_3a_double_3x3_reduce_bn"
}
layer {
  name: "inception_3a_double_3x3_1"
  type: "Convolution"
  bottom: "inception_3a_double_3x3_reduce_bn"
  top: "inception_3a_double_3x3_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3a_double_3x3_1_bn"
  type: "BN"
  bottom: "inception_3a_double_3x3_1"
  top: "inception_3a_double_3x3_1_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3a_relu_double_3x3_1_inp"
  type: "ReLU"
  bottom: "inception_3a_double_3x3_1_bn"
  top: "inception_3a_double_3x3_1_bn"
}
layer {
  name: "inception_3a_double_3x3_2"
  type: "Convolution"
  bottom: "inception_3a_double_3x3_1_bn"
  top: "inception_3a_double_3x3_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3a_double_3x3_2_bn"
  type: "BN"
  bottom: "inception_3a_double_3x3_2"
  top: "inception_3a_double_3x3_2_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3a_relu_double_3x3_2_inp"
  type: "ReLU"
  bottom: "inception_3a_double_3x3_2_bn"
  top: "inception_3a_double_3x3_2_bn"
}
layer {
  name: "inception_3a_pool"
  type: "Pooling"
  bottom: "pool2_3x3_s2"
  top: "inception_3a_pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_3a_pool_proj"
  type: "Convolution"
  bottom: "inception_3a_pool"
  top: "inception_3a_pool_proj"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3a_pool_proj_bn"
  type: "BN"
  bottom: "inception_3a_pool_proj"
  top: "inception_3a_pool_proj_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3a_relu_pool_proj_inp"
  type: "ReLU"
  bottom: "inception_3a_pool_proj_bn"
  top: "inception_3a_pool_proj_bn"
}
layer {
  name: "inception_3a_output"
  type: "Concat"
  bottom: "inception_3a_1x1_bn"
  bottom: "inception_3a_3x3_bn"
  bottom: "inception_3a_double_3x3_2_bn"
  bottom: "inception_3a_pool_proj_bn"
  top: "inception_3a_output"
}
layer {
  name: "inception_3b_1x1"
  type: "Convolution"
  bottom: "inception_3a_output"
  top: "inception_3b_1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3b_1x1_bn"
  type: "BN"
  bottom: "inception_3b_1x1"
  top: "inception_3b_1x1_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3b_relu_1x1_inp"
  type: "ReLU"
  bottom: "inception_3b_1x1_bn"
  top: "inception_3b_1x1_bn"
}
layer {
  name: "inception_3b_3x3_reduce"
  type: "Convolution"
  bottom: "inception_3a_output"
  top: "inception_3b_3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3b_3x3_reduce_bn"
  type: "BN"
  bottom: "inception_3b_3x3_reduce"
  top: "inception_3b_3x3_reduce_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3b_relu_3x3_reduce_inp"
  type: "ReLU"
  bottom: "inception_3b_3x3_reduce_bn"
  top: "inception_3b_3x3_reduce_bn"
}
layer {
  name: "inception_3b_3x3"
  type: "Convolution"
  bottom: "inception_3b_3x3_reduce_bn"
  top: "inception_3b_3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3b_3x3_bn"
  type: "BN"
  bottom: "inception_3b_3x3"
  top: "inception_3b_3x3_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3b_relu_3x3_inp"
  type: "ReLU"
  bottom: "inception_3b_3x3_bn"
  top: "inception_3b_3x3_bn"
}
layer {
  name: "inception_3b_double_3x3_reduce"
  type: "Convolution"
  bottom: "inception_3a_output"
  top: "inception_3b_double_3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3b_double_3x3_reduce_bn"
  type: "BN"
  bottom: "inception_3b_double_3x3_reduce"
  top: "inception_3b_double_3x3_reduce_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3b_relu_double_3x3_reduce_inp"
  type: "ReLU"
  bottom: "inception_3b_double_3x3_reduce_bn"
  top: "inception_3b_double_3x3_reduce_bn"
}
layer {
  name: "inception_3b_double_3x3_1"
  type: "Convolution"
  bottom: "inception_3b_double_3x3_reduce_bn"
  top: "inception_3b_double_3x3_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3b_double_3x3_1_bn"
  type: "BN"
  bottom: "inception_3b_double_3x3_1"
  top: "inception_3b_double_3x3_1_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3b_relu_double_3x3_1_inp"
  type: "ReLU"
  bottom: "inception_3b_double_3x3_1_bn"
  top: "inception_3b_double_3x3_1_bn"
}
layer {
  name: "inception_3b_double_3x3_2"
  type: "Convolution"
  bottom: "inception_3b_double_3x3_1_bn"
  top: "inception_3b_double_3x3_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3b_double_3x3_2_bn"
  type: "BN"
  bottom: "inception_3b_double_3x3_2"
  top: "inception_3b_double_3x3_2_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3b_relu_double_3x3_2_inp"
  type: "ReLU"
  bottom: "inception_3b_double_3x3_2_bn"
  top: "inception_3b_double_3x3_2_bn"
}
layer {
  name: "inception_3b_pool"
  type: "Pooling"
  bottom: "inception_3a_output"
  top: "inception_3b_pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_3b_pool_proj"
  type: "Convolution"
  bottom: "inception_3b_pool"
  top: "inception_3b_pool_proj"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3b_pool_proj_bn"
  type: "BN"
  bottom: "inception_3b_pool_proj"
  top: "inception_3b_pool_proj_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3b_relu_pool_proj_inp"
  type: "ReLU"
  bottom: "inception_3b_pool_proj_bn"
  top: "inception_3b_pool_proj_bn"
}
layer {
  name: "inception_3b_output"
  type: "Concat"
  bottom: "inception_3b_1x1_bn"
  bottom: "inception_3b_3x3_bn"
  bottom: "inception_3b_double_3x3_2_bn"
  bottom: "inception_3b_pool_proj_bn"
  top: "inception_3b_output"
}
layer {
  name: "inception_3c_3x3_reduce"
  type: "Convolution"
  bottom: "inception_3b_output"
  top: "inception_3c_3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3c_3x3_reduce_bn"
  type: "BN"
  bottom: "inception_3c_3x3_reduce"
  top: "inception_3c_3x3_reduce_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3c_relu_3x3_reduce_inp"
  type: "ReLU"
  bottom: "inception_3c_3x3_reduce_bn"
  top: "inception_3c_3x3_reduce_bn"
}
layer {
  name: "inception_3c_3x3"
  type: "Convolution"
  bottom: "inception_3c_3x3_reduce_bn"
  top: "inception_3c_3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 160
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3c_3x3_bn"
  type: "BN"
  bottom: "inception_3c_3x3"
  top: "inception_3c_3x3_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3c_relu_3x3_inp"
  type: "ReLU"
  bottom: "inception_3c_3x3_bn"
  top: "inception_3c_3x3_bn"
}
layer {
  name: "inception_3c_double_3x3_reduce"
  type: "Convolution"
  bottom: "inception_3b_output"
  top: "inception_3c_double_3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3c_double_3x3_reduce_bn"
  type: "BN"
  bottom: "inception_3c_double_3x3_reduce"
  top: "inception_3c_double_3x3_reduce_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3c_relu_double_3x3_reduce_inp"
  type: "ReLU"
  bottom: "inception_3c_double_3x3_reduce_bn"
  top: "inception_3c_double_3x3_reduce_bn"
}
layer {
  name: "inception_3c_double_3x3_1"
  type: "Convolution"
  bottom: "inception_3c_double_3x3_reduce_bn"
  top: "inception_3c_double_3x3_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3c_double_3x3_1_bn"
  type: "BN"
  bottom: "inception_3c_double_3x3_1"
  top: "inception_3c_double_3x3_1_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3c_relu_double_3x3_1_inp"
  type: "ReLU"
  bottom: "inception_3c_double_3x3_1_bn"
  top: "inception_3c_double_3x3_1_bn"
}
layer {
  name: "inception_3c_double_3x3_2"
  type: "Convolution"
  bottom: "inception_3c_double_3x3_1_bn"
  top: "inception_3c_double_3x3_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3c_double_3x3_2_bn"
  type: "BN"
  bottom: "inception_3c_double_3x3_2"
  top: "inception_3c_double_3x3_2_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_3c_relu_double_3x3_2_inp"
  type: "ReLU"
  bottom: "inception_3c_double_3x3_2_bn"
  top: "inception_3c_double_3x3_2_bn"
}
layer {
  name: "inception_3c_pool"
  type: "Pooling"
  bottom: "inception_3b_output"
  top: "inception_3c_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inception_3c_output"
  type: "Concat"
  bottom: "inception_3c_3x3_bn"
  bottom: "inception_3c_double_3x3_2_bn"
  bottom: "inception_3c_pool"
  top: "inception_3c_output"
}
layer {
  name: "inception_4a_1x1"
  type: "Convolution"
  bottom: "inception_3c_output"
  top: "inception_4a_1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 224
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4a_1x1_bn"
  type: "BN"
  bottom: "inception_4a_1x1"
  top: "inception_4a_1x1_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4a_relu_1x1_inp"
  type: "ReLU"
  bottom: "inception_4a_1x1_bn"
  top: "inception_4a_1x1_bn"
}
layer {
  name: "inception_4a_3x3_reduce"
  type: "Convolution"
  bottom: "inception_3c_output"
  top: "inception_4a_3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4a_3x3_reduce_bn"
  type: "BN"
  bottom: "inception_4a_3x3_reduce"
  top: "inception_4a_3x3_reduce_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4a_relu_3x3_reduce_inp"
  type: "ReLU"
  bottom: "inception_4a_3x3_reduce_bn"
  top: "inception_4a_3x3_reduce_bn"
}
layer {
  name: "inception_4a_3x3"
  type: "Convolution"
  bottom: "inception_4a_3x3_reduce_bn"
  top: "inception_4a_3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4a_3x3_bn"
  type: "BN"
  bottom: "inception_4a_3x3"
  top: "inception_4a_3x3_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4a_relu_3x3_inp"
  type: "ReLU"
  bottom: "inception_4a_3x3_bn"
  top: "inception_4a_3x3_bn"
}
layer {
  name: "inception_4a_double_3x3_reduce"
  type: "Convolution"
  bottom: "inception_3c_output"
  top: "inception_4a_double_3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4a_double_3x3_reduce_bn"
  type: "BN"
  bottom: "inception_4a_double_3x3_reduce"
  top: "inception_4a_double_3x3_reduce_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4a_relu_double_3x3_reduce_inp"
  type: "ReLU"
  bottom: "inception_4a_double_3x3_reduce_bn"
  top: "inception_4a_double_3x3_reduce_bn"
}
layer {
  name: "inception_4a_double_3x3_1"
  type: "Convolution"
  bottom: "inception_4a_double_3x3_reduce_bn"
  top: "inception_4a_double_3x3_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4a_double_3x3_1_bn"
  type: "BN"
  bottom: "inception_4a_double_3x3_1"
  top: "inception_4a_double_3x3_1_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4a_relu_double_3x3_1_inp"
  type: "ReLU"
  bottom: "inception_4a_double_3x3_1_bn"
  top: "inception_4a_double_3x3_1_bn"
}
layer {
  name: "inception_4a_double_3x3_2"
  type: "Convolution"
  bottom: "inception_4a_double_3x3_1_bn"
  top: "inception_4a_double_3x3_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4a_double_3x3_2_bn"
  type: "BN"
  bottom: "inception_4a_double_3x3_2"
  top: "inception_4a_double_3x3_2_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4a_relu_double_3x3_2_inp"
  type: "ReLU"
  bottom: "inception_4a_double_3x3_2_bn"
  top: "inception_4a_double_3x3_2_bn"
}
layer {
  name: "inception_4a_pool"
  type: "Pooling"
  bottom: "inception_3c_output"
  top: "inception_4a_pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_4a_pool_proj"
  type: "Convolution"
  bottom: "inception_4a_pool"
  top: "inception_4a_pool_proj"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4a_pool_proj_bn"
  type: "BN"
  bottom: "inception_4a_pool_proj"
  top: "inception_4a_pool_proj_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4a_relu_pool_proj_inp"
  type: "ReLU"
  bottom: "inception_4a_pool_proj_bn"
  top: "inception_4a_pool_proj_bn"
}
layer {
  name: "inception_4a_output"
  type: "Concat"
  bottom: "inception_4a_1x1_bn"
  bottom: "inception_4a_3x3_bn"
  bottom: "inception_4a_double_3x3_2_bn"
  bottom: "inception_4a_pool_proj_bn"
  top: "inception_4a_output"
}
layer {
  name: "inception_4b_1x1"
  type: "Convolution"
  bottom: "inception_4a_output"
  top: "inception_4b_1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 192
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4b_1x1_bn"
  type: "BN"
  bottom: "inception_4b_1x1"
  top: "inception_4b_1x1_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4b_relu_1x1_inp"
  type: "ReLU"
  bottom: "inception_4b_1x1_bn"
  top: "inception_4b_1x1_bn"
}
layer {
  name: "inception_4b_3x3_reduce"
  type: "Convolution"
  bottom: "inception_4a_output"
  top: "inception_4b_3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4b_3x3_reduce_bn"
  type: "BN"
  bottom: "inception_4b_3x3_reduce"
  top: "inception_4b_3x3_reduce_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4b_relu_3x3_reduce_inp"
  type: "ReLU"
  bottom: "inception_4b_3x3_reduce_bn"
  top: "inception_4b_3x3_reduce_bn"
}
layer {
  name: "inception_4b_3x3"
  type: "Convolution"
  bottom: "inception_4b_3x3_reduce_bn"
  top: "inception_4b_3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4b_3x3_bn"
  type: "BN"
  bottom: "inception_4b_3x3"
  top: "inception_4b_3x3_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4b_relu_3x3_inp"
  type: "ReLU"
  bottom: "inception_4b_3x3_bn"
  top: "inception_4b_3x3_bn"
}
layer {
  name: "inception_4b_double_3x3_reduce"
  type: "Convolution"
  bottom: "inception_4a_output"
  top: "inception_4b_double_3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4b_double_3x3_reduce_bn"
  type: "BN"
  bottom: "inception_4b_double_3x3_reduce"
  top: "inception_4b_double_3x3_reduce_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4b_relu_double_3x3_reduce_inp"
  type: "ReLU"
  bottom: "inception_4b_double_3x3_reduce_bn"
  top: "inception_4b_double_3x3_reduce_bn"
}
layer {
  name: "inception_4b_double_3x3_1"
  type: "Convolution"
  bottom: "inception_4b_double_3x3_reduce_bn"
  top: "inception_4b_double_3x3_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4b_double_3x3_1_bn"
  type: "BN"
  bottom: "inception_4b_double_3x3_1"
  top: "inception_4b_double_3x3_1_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4b_relu_double_3x3_1_inp"
  type: "ReLU"
  bottom: "inception_4b_double_3x3_1_bn"
  top: "inception_4b_double_3x3_1_bn"
}
layer {
  name: "inception_4b_double_3x3_2"
  type: "Convolution"
  bottom: "inception_4b_double_3x3_1_bn"
  top: "inception_4b_double_3x3_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4b_double_3x3_2_bn"
  type: "BN"
  bottom: "inception_4b_double_3x3_2"
  top: "inception_4b_double_3x3_2_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4b_relu_double_3x3_2_inp"
  type: "ReLU"
  bottom: "inception_4b_double_3x3_2_bn"
  top: "inception_4b_double_3x3_2_bn"
}
layer {
  name: "inception_4b_pool"
  type: "Pooling"
  bottom: "inception_4a_output"
  top: "inception_4b_pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_4b_pool_proj"
  type: "Convolution"
  bottom: "inception_4b_pool"
  top: "inception_4b_pool_proj"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4b_pool_proj_bn"
  type: "BN"
  bottom: "inception_4b_pool_proj"
  top: "inception_4b_pool_proj_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4b_relu_pool_proj_inp"
  type: "ReLU"
  bottom: "inception_4b_pool_proj_bn"
  top: "inception_4b_pool_proj_bn"
}
layer {
  name: "inception_4b_output"
  type: "Concat"
  bottom: "inception_4b_1x1_bn"
  bottom: "inception_4b_3x3_bn"
  bottom: "inception_4b_double_3x3_2_bn"
  bottom: "inception_4b_pool_proj_bn"
  top: "inception_4b_output"
}
layer {
  name: "inception_4c_1x1"
  type: "Convolution"
  bottom: "inception_4b_output"
  top: "inception_4c_1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 160
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4c_1x1_bn"
  type: "BN"
  bottom: "inception_4c_1x1"
  top: "inception_4c_1x1_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4c_relu_1x1_inp"
  type: "ReLU"
  bottom: "inception_4c_1x1_bn"
  top: "inception_4c_1x1_bn"
}
layer {
  name: "inception_4c_3x3_reduce"
  type: "Convolution"
  bottom: "inception_4b_output"
  top: "inception_4c_3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4c_3x3_reduce_bn"
  type: "BN"
  bottom: "inception_4c_3x3_reduce"
  top: "inception_4c_3x3_reduce_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4c_relu_3x3_reduce_inp"
  type: "ReLU"
  bottom: "inception_4c_3x3_reduce_bn"
  top: "inception_4c_3x3_reduce_bn"
}
layer {
  name: "inception_4c_3x3"
  type: "Convolution"
  bottom: "inception_4c_3x3_reduce_bn"
  top: "inception_4c_3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 160
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4c_3x3_bn"
  type: "BN"
  bottom: "inception_4c_3x3"
  top: "inception_4c_3x3_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4c_relu_3x3_inp"
  type: "ReLU"
  bottom: "inception_4c_3x3_bn"
  top: "inception_4c_3x3_bn"
}
layer {
  name: "inception_4c_double_3x3_reduce"
  type: "Convolution"
  bottom: "inception_4b_output"
  top: "inception_4c_double_3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4c_double_3x3_reduce_bn"
  type: "BN"
  bottom: "inception_4c_double_3x3_reduce"
  top: "inception_4c_double_3x3_reduce_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4c_relu_double_3x3_reduce_inp"
  type: "ReLU"
  bottom: "inception_4c_double_3x3_reduce_bn"
  top: "inception_4c_double_3x3_reduce_bn"
}
layer {
  name: "inception_4c_double_3x3_1"
  type: "Convolution"
  bottom: "inception_4c_double_3x3_reduce_bn"
  top: "inception_4c_double_3x3_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 160
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4c_double_3x3_1_bn"
  type: "BN"
  bottom: "inception_4c_double_3x3_1"
  top: "inception_4c_double_3x3_1_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4c_relu_double_3x3_1_inp"
  type: "ReLU"
  bottom: "inception_4c_double_3x3_1_bn"
  top: "inception_4c_double_3x3_1_bn"
}
layer {
  name: "inception_4c_double_3x3_2"
  type: "Convolution"
  bottom: "inception_4c_double_3x3_1_bn"
  top: "inception_4c_double_3x3_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 160
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4c_double_3x3_2_bn"
  type: "BN"
  bottom: "inception_4c_double_3x3_2"
  top: "inception_4c_double_3x3_2_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4c_relu_double_3x3_2_inp"
  type: "ReLU"
  bottom: "inception_4c_double_3x3_2_bn"
  top: "inception_4c_double_3x3_2_bn"
}
layer {
  name: "inception_4c_pool"
  type: "Pooling"
  bottom: "inception_4b_output"
  top: "inception_4c_pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_4c_pool_proj"
  type: "Convolution"
  bottom: "inception_4c_pool"
  top: "inception_4c_pool_proj"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4c_pool_proj_bn"
  type: "BN"
  bottom: "inception_4c_pool_proj"
  top: "inception_4c_pool_proj_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4c_relu_pool_proj_inp"
  type: "ReLU"
  bottom: "inception_4c_pool_proj_bn"
  top: "inception_4c_pool_proj_bn"
}
layer {
  name: "inception_4c_output"
  type: "Concat"
  bottom: "inception_4c_1x1_bn"
  bottom: "inception_4c_3x3_bn"
  bottom: "inception_4c_double_3x3_2_bn"
  bottom: "inception_4c_pool_proj_bn"
  top: "inception_4c_output"
}
layer {
  name: "inception_4d_1x1"
  type: "Convolution"
  bottom: "inception_4c_output"
  top: "inception_4d_1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4d_1x1_bn"
  type: "BN"
  bottom: "inception_4d_1x1"
  top: "inception_4d_1x1_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4d_relu_1x1_inp"
  type: "ReLU"
  bottom: "inception_4d_1x1_bn"
  top: "inception_4d_1x1_bn"
}
layer {
  name: "inception_4d_3x3_reduce"
  type: "Convolution"
  bottom: "inception_4c_output"
  top: "inception_4d_3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4d_3x3_reduce_bn"
  type: "BN"
  bottom: "inception_4d_3x3_reduce"
  top: "inception_4d_3x3_reduce_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4d_relu_3x3_reduce_inp"
  type: "ReLU"
  bottom: "inception_4d_3x3_reduce_bn"
  top: "inception_4d_3x3_reduce_bn"
}
layer {
  name: "inception_4d_3x3"
  type: "Convolution"
  bottom: "inception_4d_3x3_reduce_bn"
  top: "inception_4d_3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4d_3x3_bn"
  type: "BN"
  bottom: "inception_4d_3x3"
  top: "inception_4d_3x3_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4d_relu_3x3_inp"
  type: "ReLU"
  bottom: "inception_4d_3x3_bn"
  top: "inception_4d_3x3_bn"
}
layer {
  name: "inception_4d_double_3x3_reduce"
  type: "Convolution"
  bottom: "inception_4c_output"
  top: "inception_4d_double_3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 160
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4d_double_3x3_reduce_bn"
  type: "BN"
  bottom: "inception_4d_double_3x3_reduce"
  top: "inception_4d_double_3x3_reduce_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4d_relu_double_3x3_reduce_inp"
  type: "ReLU"
  bottom: "inception_4d_double_3x3_reduce_bn"
  top: "inception_4d_double_3x3_reduce_bn"
}
layer {
  name: "inception_4d_double_3x3_1"
  type: "Convolution"
  bottom: "inception_4d_double_3x3_reduce_bn"
  top: "inception_4d_double_3x3_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4d_double_3x3_1_bn"
  type: "BN"
  bottom: "inception_4d_double_3x3_1"
  top: "inception_4d_double_3x3_1_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4d_relu_double_3x3_1_inp"
  type: "ReLU"
  bottom: "inception_4d_double_3x3_1_bn"
  top: "inception_4d_double_3x3_1_bn"
}
layer {
  name: "inception_4d_double_3x3_2"
  type: "Convolution"
  bottom: "inception_4d_double_3x3_1_bn"
  top: "inception_4d_double_3x3_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 2.0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "inception_4d_double_3x3_2_bn"
  type: "BN"
  bottom: "inception_4d_double_3x3_2"
  top: "inception_4d_double_3x3_2_bn"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bn_param { frozen: true
    slope_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
